backend/resource/3.json

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="urn:tooling.soap.sforce.com" xmlns:mns="urn:metadata.tooling.soap.sforce.com" xmlns:ens="urn:sobject.tooling.soap.sforce.com" xmlns:fns="urn:fault.tooling.soap.sforce.com"><soap:Header><tns:SessionHeader><tns:sessionId>00D6F000002SIIE!AQwAQMul1NoFIBzNbFznfe3SID993kWEzpZxxzDUNjIHMJPzsizNZlB2KOImvrc.yaUck.c6.7CZp1Rjd8StxbilpLCIFFze</tns:sessionId></tns:SessionHeader><tns:DebuggingHeader><categories><category>Db</category><level>INFO</level></categories><categories><category>Workflow</category><level>INFO</level></categories><categories><category>Validation</category><level>INFO</level></categories><categories><category>Callout</category><level>INFO</level></categories><categories><category>Apex_code</category><level>FINEST</level></categories><categories><category>Apex_profiling</category><level>INFO</level></categories><categories><category>Visualforce</category><level>INFO</level></categories><categories><category>System</category><level>FINE</level></categories><categories><category>All</category><level>NONE</level></categories></tns:DebuggingHeader></soap:Header><soap:Body><executeAnonymous xmlns="urn:tooling.soap.sforce.com"><string>string x = &apos;a&apos;; system.debug(x);</string></executeAnonymous></soap:Body></soap:Envelope>